cosjef/stripe-business-metrics-monitor/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8MB onboard. Matters later for buffering Stripe API responses
# (spec 8.3 assumed this was not available; this board has it).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL: RGB565. The byte swap the panel needs is set via `swap_bytes` in the
# lvgl_port display config, NOT here -- CONFIG_LV_COLOR_16_SWAP was an LVGL 8
# option and is silently ignored by LVGL 9.
CONFIG_LV_COLOR_DEPTH_16=y

# Use the DARK default theme. Without this LVGL paints its light theme
# background onto the screen object, which shows through as a light field
# regardless of the background color the app sets (spec 4.1 wants #121211).
CONFIG_LV_THEME_DEFAULT_DARK=y

# Fonts. We ship our own monospace bitmap set (main/fonts/, generated by
# tools/gen_fonts.sh) at the spec's exact sizes, so none of LVGL's stock
# Montserrat faces are needed. Montserrat is also proportional, which spec 5.4
# rules out: tabular figures are what stop numbers jittering when 94 becomes
# 100. LVGL's stock sizes also cap at 48px, below the spec's 96px hero maximum.
#
# LV_FONT_DEFAULT must point at a font that is actually compiled in.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# TLS: use Espressif's bundled Mozilla CA roots rather than pinning Stripe's
# current root. Pinning is smaller, but a root rotation would brick devices in
# the field until firmware is updated (spec 8.2 flags CA upkeep as a real cost).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# esp_http_client needs a larger stack for the TLS handshake.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
